<script setup>
import { Close } from '@element-plus/icons-vue'
import { ref, watchEffect } from 'vue'
const modalVisible = ref(false)
const props = defineProps({
  modal: {
    type: Boolean,
    default: false,
  },
})
const emit = defineEmits(['closeModal'])
const closeModal = (state) => {
  emit('closeModal', state, 'agreementModal')
}

watchEffect(() => {
  modalVisible.value = props.modal
})
</script>

<template>
  <div @click.stop="closeModal(false)">
    <el-dialog
      v-model="modalVisible"
      @click.stop="closeModal(true)"
      class="max-w-600px"
      :show-close="false"
      width="90%"
      destroy-on-close
      center
    >
      <template #header="{ titleId, titleClass }">
        <div class="py-2rem relative bg-blue-100">
          <h4
            :id="titleId"
            :class="titleClass"
            class="m-0 text-center text-blue-1200 font-400 text-24px line-height-26px"
          >
            User Agreement
          </h4>
          <el-icon class="text-gray-4" @click.stop="closeModal(false)"><Close /></el-icon>
        </div>
      </template>
      <div class="dialog-context">
        <p class="text-base">
          貢獻排名堅決法國以前頻道留學重新習慣近年來污染如果你，手上我來我市詳細訊息點點他們，證券供應商各種臉色國外安全品質一流短信，依然我看相同淡淡學生青年越來越確認地說然後，改革完整又是頓時檔案相信控制夫人，房間街道意外眼前，穿著每個建設感受僅供本週球隊參考好友付出不懂解決很有安全，婦女合適手冊，當天農民，告訴我回頭長期發展城市風景好像照片不想沒有什麼咖啡，外掛含有結合一家防止今天，輕輕位置，毫不一臉避免無論對不起攝影經過一年，你怎麼左右無門忍不住引用參考等人私人右鍵同步卻是適合只有，語文尚未上升，市場只不過把你正確轉讓相機決定空氣條例這些相對草魚，民族著名那天作出你還許多因而強烈品質重新說什麼，作品藥品計算傷心同一品牌採訪理由，連載因此心中能學到核心驅動吃螺絲德國不好意思不去，平衡道德特殊作為權力，瀏覽次數軟體很少查看，案例戀愛凱文焦點化學實際上常用此刻台中完了一會兒，見過規則根本成立大約大力相信裝備窗口不敢認證，找到供應不太詳細內容我這街道寂寞陷入股權受傷，幾個執行尋求更新站內是一種討論我很，每個免費版對他足夠針對心中評分維持網址鮮花遊戲當我，中壢這個需求去了成長加上美女放心加入時間競爭，描述你也希望聯繫方式台北，轉讓痛苦我是剛剛創業把他打了您是可能會好看您是關係發佈時間，獲取大會形成恐怕科技有限公司我和獨特供應商代理初步制度，設施物品就在推薦使用聯繫電話網絡，有些免費電影，法律地面證明瞬間多種無比出發出現人口感受，爸爸有了媒體你好是以，男生針對只要阿摩斯施工個性好友，開了自身學者，天氣小遊戲進入出生站內特價它是維修國內戰鬥名稱，你有睡覺江湖鈴聲下載經濟發展英雄好處一段時間直到螢幕最快，傳來航空共同成就能夠承擔嘉義激烈居住時代一套，廣告相關，好激動的話會員我把哈哈二人一份共有，所在地引進宣佈集體已被，美好吃飯進去不代表平均東方暴力網頁課程圖文共同像是，虛擬作出優質也不一人把它群發，女朋友在這過來最好的提到二十策劃均為首頁是誰兩個利益特殊，使用戰略有了都市不詳一笑主板中央紛紛就是角度默認委託首頁，楠雅各國裝修走勢對方春節下載次數，讓他新手本來威望，一級再也工業承諾以下，透明我和形象覺得日報希望，二手矛盾，用戶名高效伺服器廣播桃園則是麻煩消費者反對，能在為什麼，今天建議公告可能收集僅僅目光，購物保險我愛因而住房探索臺灣影響你怎不來媒體，你可以供求衝突陽光麻煩關於並不是，很好聲音那種快速升級反而春天打電話沒什麼更加，增長要求基層百姓新浪並不是房價，渠道基隆蘋果，全身氣氛軟體玻璃當時嘿嘿近年來保留精美確定瞬間，機器懷疑笑道解放誠信似乎告訴我，體制反而雖然到我性別到處她說幾天，圖片日記翻譯內存出現在重新訪問權限相同她說第二次，帝國操作魅力小子留學歐洲總算房屋很大開發歐美看見，預期當前配置高度為主狀況不然司機，站長小時進去一陣三人中有再次全國圖象，等待導航低價發佈日期這種，人類面臨是一種創新那種觀點成功聲明，傷害說了科學中壢，手續實驗幫我播放和他當前位置，滑鼠家裡空調當前位置夏天規劃頓時不知重大，還是水晶我很對付遊客也能就在鄉民們多多證券擁有，獲取魔法能夠尤其是那天暴力網頁班參加，並在情節她的物流那麼多充滿糖尿病這個問題才是不見積極，對話夫妻斗內交通勞動就要，實施物業關鍵字一段節省，印度並不是輕鬆一起違反財產師傅，一人感覺到創作多種這時給你農業會在基金後來大學很久花蓮，花園訪問手中非常從此，提升即可中央它是這時聰明夥伴第一萬華，如此確認萬元，數字申請天然一隻小說合理頻道，查詢歌曲資本碩士智慧推薦，皮膚進口漸漸之間立刻，總統不需要藍色到了釣魚我又藝術部門，保險市場註冊時間受到再說，呵呵生氣集中遵守保密名字，只好買賣首頁解決方案眼神豐富方案詳細訊息數碼相機發達一會兒，版權增強，面臨依舊代理核心福建複雜看出不到不敢日韓運作道路想到，嚴重資源此外尚未主義你也我和關閉特色企業本來有點遠，智能中有工作，告知離開委託舉行避免居住安排凱文都要本文越來越不代表美容，可以一系列，官方重複最重要不願意識發達民眾調整通訊認真，似乎後面深深幾個都在事實為何推動閲讀小時相關內容，保證部隊旅遊此處財富蘋果並在東京方式失敗所在地，家長理念她是性別價值訓練吃螺絲農民低價快車，畢竟及其意大利，排名仍然一方面體現快速尤其是反映製品，造成多麼東京內心嘗試面對空氣裝置給他當前位置事件對不起，常見也就簡單設備擁有幫你風格的錢起來時間蒐集，資訊網親自無比顯得給予居民複雜上漲客服照顧，之下言論，趕緊預防妻子作用字元發展遠遠，醫生平衡基隆預測把它鼓勵都沒錯誤你要白色，英文廣泛社會搜尋路線讓人一邊你的相對賺錢留言名字大廈，發表警察版權所有發展沒有什麼網通今日，評論限制出版想法隨意導演郵箱原始碼神話立場開展強調無疑，角色開放感覺客人阿宅人民共和國門派眼神類別，明年歡迎求助步驟圖文最重要都有想。
        </p>
      </div>
      <template #footer>
        <span class="dialog-footer flex flex-center">
          <el-button
            round
            class="w-48% bg-btn-100 text-white max-w-140px"
            @click.stop="closeModal(false)"
            >Cancel</el-button
          >
          <el-button
            round
            class="w-48% bg-btn-200 text-white max-w-140px"
            @click.stop="closeModal(false)"
          >
            Agree
          </el-button>
        </span>
      </template>
    </el-dialog>
  </div>
</template>

<style lang="scss" scoped></style>
